khoih-prog/AsyncWebServer_ESP32_W6100/src/AsyncWebServer_ESP32_W6100.h
/****************************************************************************************************************************
  AsyncWebServer_ESP32_W6100.h - Dead simple Ethernet AsyncWebServer.

  For W6100 LwIP Ethernet in ESP32 (ESP32 + W6100)

  AsyncWebServer_ESP32_W6100 is a library for the LwIP Ethernet W6100 in ESP32 to run AsyncWebServer

  Based on and modified from ESPAsyncWebServer (https://github.com/me-no-dev/ESPAsyncWebServer)
  Built by Khoi Hoang https://github.com/khoih-prog/AsyncWebServer_ESP32_W6100
  Licensed under GPLv3 license

  Original author: Hristo Gochkov

  Copyright (c) 2016 Hristo Gochkov. All rights reserved.

  This library is free software; you can redistribute it and/or modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public License along with this library;
  if not, write to the Free Software Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

  Version: 1.6.4

  Version Modified By   Date      Comments
  ------- -----------  ---------- -----------
  1.6.4   K Hoang      09/01/2023 Initial porting for ESP32 + W6100. Sync with AsyncWebServer_ESP32_W5500 v1.6.4
 *****************************************************************************************************************************/

#ifndef _AsyncWebServer_ESP32_W6100_H_
#define _AsyncWebServer_ESP32_W6100_H_

////////////////////////////////////////

#if ( ARDUINO_ESP32S2_DEV || ARDUINO_FEATHERS2 || ARDUINO_ESP32S2_THING_PLUS || ARDUINO_MICROS2 || \
      ARDUINO_METRO_ESP32S2 || ARDUINO_MAGTAG29_ESP32S2 || ARDUINO_FUNHOUSE_ESP32S2 || \
      ARDUINO_ADAFRUIT_FEATHER_ESP32S2_NOPSRAM )

  #error ESP32_S2 not supported. Use AsyncWebServer_ESP32_SC_W6100 library

#elif ( ARDUINO_ESP32C3_DEV )

  #error ESP32_C3 not supported. Use AsyncWebServer_ESP32_SC_W6100 library

#elif ( defined(ARDUINO_ESP32S3_DEV) || defined(ARDUINO_ESP32_S3_BOX) || defined(ARDUINO_TINYS3) || \
        defined(ARDUINO_PROS3) || defined(ARDUINO_FEATHERS3) )

  #error ESP32_S3 not supported. Use AsyncWebServer_ESP32_SC_W6100 library

#elif ESP32

  #if (_ASYNC_WEBSERVER_LOGLEVEL_ > 3)
    #warning Using ESP32 architecture for AsyncWebServer_ESP32_SC_W6100
  #endif

  #define BOARD_NAME      ARDUINO_BOARD

#else
  #error This code is designed to run on ESP32 platform! Please check your Tools->Board setting.
#endif

////////////////////////////////////////

#if ( ( defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 2) ) && ( ARDUINO_ESP32_GIT_VER != 0x46d5afb1 ) )
  #define USING_CORE_ESP32_CORE_V200_PLUS      true

  #if (_ASYNC_WEBSERVER_LOGLEVEL_ > 3 )
    #warning Using code for ESP32 core v2.0.0+ in AsyncWebServer_ESP32_W6100.h
  #endif

  #define ASYNC_WEBSERVER_ESP32_W6100_VERSION      "AsyncWebServer_ESP32_W6100 v1.6.4 for core v2.0.0+"
#else

  #if (_ASYNC_WEBSERVER_LOGLEVEL_ > 3 )
    #warning Using code for ESP32 core v1.0.6- in AsyncWebServer_ESP32_W6100.h
  #endif

  #define ASYNC_WEBSERVER_ESP32_W6100_VERSION      "AsyncWebServer_ESP32_W6100 v1.6.4 for core v1.0.6-"
#endif

#define ASYNC_WEBSERVER_ESP32_W6100_VERSION_MAJOR     1
#define ASYNC_WEBSERVER_ESP32_W6100_VERSION_MINOR     6
#define ASYNC_WEBSERVER_ESP32_W6100_VERSION_PATCH     4

#define ASYNC_WEBSERVER_ESP32_W6100_VERSION_INT       1006004

////////////////////////////////////////

#ifndef ESP32_W6100_AWS_UNUSED
  #define ESP32_W6100_AWS_UNUSED(x)       (void)(x)
#endif

////////////////////////////////////////

#include "Arduino.h"

#include <functional>
#include "FS.h"

#include "StringArray.h"

////////////////////////////////////////
// ESP32_W6100 related code

#include "AsyncWebServer_ESP32_W6100_Debug.h"

#include <WiFi.h>
#include <WebServer.h> // Introduce corresponding libraries

#include "w6100/esp32_w6100.h"

#include <hal/spi_types.h>

////////////////////////////////////////

#if !defined(ETH_SPI_HOST)
  #define ETH_SPI_HOST            SPI3_HOST
#endif

#if !defined(SPI_CLOCK_MHZ)
  // Using 25MHz for W6100, 14MHz for W5100
  #define SPI_CLOCK_MHZ       25
#endif

#if !defined(INT_GPIO)
  #define INT_GPIO            4
#endif

#if !defined(MISO_GPIO)
  #define MISO_GPIO           19
#endif

#if !defined(MOSI_GPIO)
  #define MOSI_GPIO           23
#endif

#if !defined(SCK_GPIO)
  #define SCK_GPIO            18
#endif

#if !defined(CS_GPIO)
  #define CS_GPIO             5
#endif

#ifndef SHIELD_TYPE
  #define SHIELD_TYPE         "ESP32_W6100"
#endif

////////////////////////////////////////

extern bool ESP32_W6100_eth_connected;

extern void ESP32_W6100_onEvent();

extern void ESP32_W6100_waitForConnect();

extern bool ESP32_W6100_isConnected();

extern void ESP32_W6100_event(WiFiEvent_t event);

////////////////////////////////////////

#include <AsyncTCP.h>

#ifdef ASYNCWEBSERVER_REGEX
  #define ASYNCWEBSERVER_REGEX_ATTRIBUTE
#else
  #define ASYNCWEBSERVER_REGEX_ATTRIBUTE      __attribute__((warning("ASYNCWEBSERVER_REGEX not defined")))
#endif

#define DEBUGF(...) //Serial.printf(__VA_ARGS__)

class AsyncWebServer;
class AsyncWebServerRequest;
class AsyncWebServerResponse;
class AsyncWebHeader;
class AsyncWebParameter;
class AsyncWebRewrite;
class AsyncWebHandler;
class AsyncStaticWebHandler;
class AsyncCallbackWebHandler;
class AsyncResponseStream;

////////////////////////////////////////

#ifndef WEBSERVER_H

typedef enum
{
  HTTP_GET     = 0b00000001,
  HTTP_POST    = 0b00000010,
  HTTP_DELETE  = 0b00000100,
  HTTP_PUT     = 0b00001000,
  HTTP_PATCH   = 0b00010000,
  HTTP_HEAD    = 0b00100000,
  HTTP_OPTIONS = 0b01000000,
  HTTP_ANY     = 0b01111111,
} WebRequestMethod;

#endif

//if this value is returned when asked for data, packet will not be sent and you will be asked for data again
#define RESPONSE_TRY_AGAIN      0xFFFFFFFF

typedef uint8_t WebRequestMethodComposite;
typedef std::function<void(void)> ArDisconnectHandler;

