khoih-prog/AsyncWebServer_ESP32_W6100/src/AsyncWebServer_ESP32_W6100.h
////////////////////////////////////////

/*
   PARAMETER :: Chainable object to hold GET/POST and FILE parameters
 * */

class AsyncWebParameter
{
  private:
    String _name;
    String _value;
    size_t _size;
    bool _isForm;
    bool _isFile;

  public:

    AsyncWebParameter(const String& name, const String& value, bool form = false, bool file = false,
                      size_t size = 0): _name(name), _value(value), _size(size), _isForm(form), _isFile(file)  {}

    /////////////////////////////////////////////////

    inline const String& name() const
    {
      return _name;
    }

    /////////////////////////////////////////////////

    inline const String& value() const
    {
      return _value;
    }

    /////////////////////////////////////////////////

    inline size_t size() const
    {
      return _size;
    }

    /////////////////////////////////////////////////

    inline bool isPost() const
    {
      return _isForm;
    }

    /////////////////////////////////////////////////

    inline bool isFile() const
    {
      return _isFile;
    }

    /////////////////////////////////////////////////

};

////////////////////////////////////////

/*
   HEADER :: Chainable object to hold the headers
 * */

class AsyncWebHeader
{
  private:
    String _name;
    String _value;

  public:
    AsyncWebHeader(const String& name, const String& value): _name(name), _value(value) {}

    /////////////////////////////////////////////////

    AsyncWebHeader(const String& data): _name(), _value()
    {
      if (!data)
        return;

      int index = data.indexOf(':');

      if (index < 0)
        return;

      _name = data.substring(0, index);
      _value = data.substring(index + 2);
    }

    /////////////////////////////////////////////////

    ~AsyncWebHeader() {}

    /////////////////////////////////////////////////

    inline const String& name() const
    {
      return _name;
    }

    /////////////////////////////////////////////////

    inline const String& value() const
    {
      return _value;
    }

    /////////////////////////////////////////////////

    inline String toString() const
    {
      return String(_name + ": " + _value + "\r\n");
    }

    /////////////////////////////////////////////////

};

////////////////////////////////////////

/*
   REQUEST :: Each incoming Client is wrapped inside a Request and both live together until disconnect
 * */

typedef enum
{
  RCT_NOT_USED = -1,
  RCT_DEFAULT = 0,
  RCT_HTTP,
  RCT_WS,
  RCT_EVENT,
  RCT_MAX
} RequestedConnectionType;

typedef std::function<size_t(uint8_t*, size_t, size_t)> AwsResponseFiller;
typedef std::function<String(const String&)> AwsTemplateProcessor;

////////////////////////////////////////

class AsyncWebServerRequest
{
    using File = fs::File;
    using FS = fs::FS;
    friend class AsyncWebServer;
    friend class AsyncCallbackWebHandler;

  private:
    AsyncClient* _client;
    AsyncWebServer* _server;
    AsyncWebHandler* _handler;
    AsyncWebServerResponse* _response;
    StringArray _interestingHeaders;
    ArDisconnectHandler _onDisconnectfn;

    String _temp;
    uint8_t _parseState;

    uint8_t _version;
    WebRequestMethodComposite _method;
    String _url;
    String _host;
    String _contentType;
    String _boundary;
    String _authorization;
    RequestedConnectionType _reqconntype;
    void _removeNotInterestingHeaders();
    bool _isDigest;
    bool _isMultipart;
    bool _isPlainPost;
    bool _expectingContinue;
    size_t _contentLength;
    size_t _parsedLength;

    LinkedList<AsyncWebHeader *> _headers;
    LinkedList<AsyncWebParameter *> _params;
    LinkedList<String *> _pathParams;

    uint8_t _multiParseState;
    uint8_t _boundaryPosition;
    size_t _itemStartIndex;
    size_t _itemSize;
    String _itemName;
    String _itemFilename;
    String _itemType;
    String _itemValue;
    uint8_t *_itemBuffer;
    size_t _itemBufferIndex;
    bool _itemIsFile;

    void _onPoll();
    void _onAck(size_t len, uint32_t time);
    void _onError(int8_t error);
    void _onTimeout(uint32_t time);
    void _onDisconnect();
    void _onData(void *buf, size_t len);

    void _addParam(AsyncWebParameter*);
    void _addPathParam(const char *param);

    bool _parseReqHead();
    bool _parseReqHeader();
    void _parseLine();
    void _parsePlainPostChar(uint8_t data);
    void _parseMultipartPostByte(uint8_t data, bool last);
    void _addGetParams(const String& params);

    void _handleUploadStart();
    void _handleUploadByte(uint8_t data, bool last);
    void _handleUploadEnd();

  public:
    File _tempFile;
    void *_tempObject;

    AsyncWebServerRequest(AsyncWebServer*, AsyncClient*);
    ~AsyncWebServerRequest();

    /////////////////////////////////////////////////

    inline AsyncClient* client()
    {
      return _client;
    }

    /////////////////////////////////////////////////

    inline uint8_t version() const
    {
      return _version;
    }

    /////////////////////////////////////////////////

    inline WebRequestMethodComposite method() const
    {
      return _method;
    }

    /////////////////////////////////////////////////

    inline const String& url() const
    {
      return _url;
    }

    /////////////////////////////////////////////////

    inline const String& host() const
    {
      return _host;
    }

    /////////////////////////////////////////////////

    inline const String& contentType() const
    {
      return _contentType;
    }

    /////////////////////////////////////////////////

    inline size_t contentLength() const
    {
      return _contentLength;
    }

    /////////////////////////////////////////////////

    inline bool multipart() const
    {
      return _isMultipart;
    }

    /////////////////////////////////////////////////

    const char * methodToString() const;
    const char * requestedConnTypeToString() const;

    /////////////////////////////////////////////////

    inline RequestedConnectionType requestedConnType() const
    {
      return _reqconntype;
    }

    /////////////////////////////////////////////////

    bool isExpectedRequestedConnType(RequestedConnectionType erct1, RequestedConnectionType erct2 = RCT_NOT_USED,
                                     RequestedConnectionType erct3 = RCT_NOT_USED);
    void onDisconnect (ArDisconnectHandler fn);

    //hash is the string representation of:
    // base64(user:pass) for basic or
    // user:realm:md5(user:realm:pass) for digest
    bool authenticate(const char * hash);
    bool authenticate(const char * username, const char * password, const char * realm = NULL, bool passwordIsHash = false);
    void requestAuthentication(const char * realm = NULL, bool isDigest = true);

    /////////////////////////////////////////////////

    inline void setHandler(AsyncWebHandler *handler)
    {
      _handler = handler;
    }

    /////////////////////////////////////////////////

    void addInterestingHeader(const String& name);

    void redirect(const String& url);

    void send(AsyncWebServerResponse *response);
    void send(int code, const String& contentType = String(), const String& content = String());

    void send(int code, const String& contentType, const char *content, bool nonDetructiveSend = true);    // RSMOD

    void send(FS &fs, const String& path, const String& contentType = String(), bool download = false,
              AwsTemplateProcessor callback = nullptr);
    void send(File content, const String& path, const String& contentType = String(), bool download = false,
              AwsTemplateProcessor callback = nullptr);
    void send(Stream &stream, const String& contentType, size_t len, AwsTemplateProcessor callback = nullptr);
    void send(const String& contentType, size_t len, AwsResponseFiller callback,
              AwsTemplateProcessor templateCallback = nullptr);

    void sendChunked(const String& contentType, AwsResponseFiller callback,
                     AwsTemplateProcessor templateCallback = nullptr);

    void send_P(int code, const String& contentType, const uint8_t * content, size_t len,
                AwsTemplateProcessor callback = nullptr);
    void send_P(int code, const String& contentType, PGM_P content, AwsTemplateProcessor callback = nullptr);

